In [6]:
import pandas as pd
rollno={'kk':594,'ck':528,'cs':528}
rollno=pd.Series(rollno)
print(rollno)
internal1={'kk':30,'ck':40,'cs':60}
internal1=pd.Series(internal1)
print(internal1)
internal2={'kk':20,'ck':10,'cs':30}
internal2=pd.Series(internal2)
print(internal2)

kk    594
ck    528
cs    528
dtype: int64
kk    30
ck    40
cs    60
dtype: int64
kk    20
ck    10
cs    30
dtype: int64

In [7]:
final={'Rollno':rollno,'Internal1':internal1,'Internal2':internal2}
final=pd.DataFrame(final)
print(final)

    Rollno  Internal1  Internal2
kk     594         30         20
ck     528         40         10
cs     528         60         30

In [8]:
final

    Rollno  Internal1  Internal2
kk     594         30         20
ck     528         40         10
cs     528         60         30

In [9]:
final.columns

Index(['Rollno', 'Internal1', 'Internal2'], dtype='object')

In [10]:
final.values

array([[594,  30,  20],
       [528,  40,  10],
       [528,  60,  30]], dtype=int64)

In [11]:
final.values[2,0]

528

In [13]:
#### Reading the csv file using pandas:

import pandas as pd
income=pd.read_csv("income.csv")
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

income.columns()

In [14]:
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [15]:
income.values[1][1]

'Alaska'

In [16]:
for i in income.values:
    print(i[1],":",i[10])

Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
California : 57528

In [17]:
s=0
for i in range(2,11):
    s+=income.values[2][i]
print(s)

424933

### average income of alaska in all years

In [21]:
import pandas as pd
s=0
count=0
for i in range(2,11):
    s+=income.values[2][i]
    count+=1
    avg=(s)/count
print(avg)

47214.77777777778

#### averge incomes of all states  in 2012

In [38]:
income['2012'].mean()

50038.8

### create a function to print all columns in a single line

In [34]:
income.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

### create a function to access a row based on a unique column value

In [43]:
def fun1():
    return income.columns
fun1()

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [44]:
def fun2(a):
    return income.values[a]
fun2(4)

array(['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
       54283, 53367, 57020, 57528], dtype=object)

#### create a function to find the average income  of all states from  2005 to 2013

In [46]:
def fun3():
    a=[]
    for i in range(0,5):
        s=c=0
        for j in range(2,11):
            s=s+income.values[i][j]
            c=c+1
        print("Average income of "+income.values[i][1]+" is:",(s//c))
        a.append(s//c)
    b=len(a)
    print("Average income of all states from 2005 to 2013 is:",(sum(a)//b))
fun3()

Average income of Alabama is: 41126
Average income of Alaska is: 60106
Average income of Arizona is: 47214
Average income of Arkansas is: 38828
Average income of California is: 55350
Average income of all states from 2005 to 2013 is: 48524

In [47]:
def fun4():
    s=0
    for i in range(2005,2014):
        if(s<=4):
            print("Average income of "+income.values[s][1]+" is:",income[str(i)].mean())
            s=s+1
fun4()

Average income of Alabama is: 45339.8
Average income of Alaska is: 46680.6
Average income of Arizona is: 49789.8
Average income of Arkansas is: 50395.8
Average income of California is: 47999.0

#### Create a function to find the heighest average income in the last three years

In [48]:
s1=s2=s3=c=0
for i in income.values:
    s1=s1+i[8]
    s2=s2+i[9]
    s3=s3+i[10]
    c=c+1
if(s1>s2 and s1>s3):
    print("Highest average income of- "+income.columns[8]+" is:",s1)
elif(s2>s1 and s2>s3):
    print("Highest average income of- "+income.columns[9]+" is:",s2)
else:
    print("Highest average income of- "+income.columns[10]+" is:",s3)

Highest average income of- 2013 is: 250567

#### Create a function to find the lowest average income from 2007 to 2010(inclusive)

In [49]:
def fun5():
    s1=s2=s3=s4=c=0
    for i in income.values:
        s1+=i[4]
        s2+=i[5]
        s3+=i[6]
        s4+=i[7]
        c+=1
    if(s1<s2 and s1<s3 and s1<s4):
         print("Lowest average income of- "+income.columns[4]+" is:",s1)
    elif(s2<s1 and s2<s3 and s2<s4):
         print("Lowest average income of- "+income.columns[5]+" is:",s2)
    elif(s3<s1 and s3<s2 and s3<s4):
         print("Lowest average income of- "+income.columns[6]+" is:",s3)
    else:
         print("Lowest average income of- "+income.columns[7]+" is:",s4)
fun5()

Lowest average income of- 2010 is: 238547

#### Print the list of all states in the same line with average income less than Calfornia

In [50]:
def fun6():
    n=[]
    m=[]
    for i in range(0,5):
        s=c=0
        for j in range(2,11):
            s=s+income.values[i][j]
            c+=1
        n.append(s//c)
    for i in n:
        if(i<n[-1]):
            m.append(income.values[n.index(i)][1])
    print(m)
fun6()

['Alabama', 'Arizona', 'Arkansas']

#### Print the names of states based on desending order of their averages in the year 2009

In [52]:
def fun4():
    s=0
    b=[]
    c={}
    for i in range(len(income)+1):
        if(s<=4):
            c[int(income.values[i][2:].mean())]=income.values[s][1]
            s+=1
    a=sorted(c,reverse=True)
    for i in a:
        if i in c:
            b.append(c.get(i))
    print("Desecding order of income averages:",b)
fun4()

Desecding order of income averages: ['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

#### State the lowest recorded income based from 2005 to 2013

In [53]:
v=[]
for i in range(0,5):
    for j in range(2,11):
        v.append(income.values[i][j])
min(v)

36538

In [54]:

len(income)

5